# Banco de dados

Banco de dados é uma estrutura organizada para armazenar, gerenciar e recuperar informações de forma eficiente. Um termo conhecido é o CRUD (create, read, update e delete). Conheceremos agora um banco de dados para testes, chamado Sqlite3.

In [1]:
# importando a biblioteca para fazer operações em banco de dados sqlite3
import sqlite3
# importando a bibliotecas pandas para transformar dados e tabelas do banco em data frames 
import pandas as pd

# CONNECTION

In [2]:
# criaremos a conexão com nosso banco de dados
# se ele não existir, será criado
conn = sqlite3.connect("database.db")

# CREATE TABLE

In [3]:
# Podemos agora criar tabelas
# criaremos a tabela (table) tasks com campos (fields) id, description e done
conn.execute("""
    CREATE TABLE IF NOT EXISTS tasks
    (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        description TEXT,
        done INTEGER
    )    
""")
# após executar uma operação é necessário salvá-la
conn.commit()

# CREATE

In [4]:
# criaremos agora um registro (row) na tabela tasks
# o registro terá valor 'Estudar seaborn' para description e 0 para done.
conn.execute("""
    INSERT INTO tasks (description, done)
    VALUES ('Estudar seaborn', 0);    
""")
# novamente, após executar o comando é necessário salvar
conn.commit()

In [5]:
# TODO

# crie um registro (row) na tabela tasks
# o registro terá valor 'Estudar python' para description e 1 para done.
conn.execute("""
 
""")
# novamente, após executar o comando é necessário salvar
conn.commit()

In [6]:
# TODO

# crie um registro (row) na tabela tasks
# o registro terá valor 'Entregar livro' para description e 0 para done.
conn.execute("""
 
""")
# novamente, após executar o comando é necessário salvar
conn.commit()

# READ

In [7]:
# podemos agora visualizar todos (*) os registros da (FROM) tabela tasks
results = conn.execute("""
    SELECT *
    FROM tasks
""").fetchall()
# imprimindo cada resultado
for result in results:
    print(result)

(1, 'Estudar seaborn', 0)

In [8]:
# ver os valores de description da (FROM) tabela tasks onde (WHERE) done = 0
results = conn.execute("""
    SELECT description
    FROM tasks
    WHERE done=0
""").fetchall()
# imprimindo cada resultado
for result in results:
    print(result)

('Estudar seaborn',)

In [9]:
# TODO

# ver os valores de description da (FROM) tabela tasks onde (WHERE) done = 0 e description começa com 'Estudar'
results = conn.execute("""

""").fetchall()
# imprimindo cada resultado
for result in results:
    print(result)

# UPDATE

In [10]:
# Atualizar (update) na tabela tasks as linhas (rows) cujo id = 1 fazendo (SET) done = 1
conn.execute("""
    UPDATE tasks
    SET done=1
    WHERE id=1
""")
# salvando as atualizações
conn.commit()

In [11]:
# TODO

# Atualizar (update) na tabela tasks as linhas (rows) cujo description = "Estudar seaborn" fazendo (SET) description = "Estudar matplotlib"
conn.execute("""

""")
# salvando as atualizações
conn.commit()

# DELETE

In [12]:
# deletar da (FROM) tabela tasks as linhas (rows) onde id = 1
conn.execute("""
    DELETE FROM tasks
    WHERE id=1
""")
conn.commit()

# Pandas query

Quando se fala em tabelas, uma das bibliotecas mais utilizar é a biblioteca pandas. Para nossa conveniência, o método read_sql_query da biblioteca retorna data frames de consultas SQL.

In [13]:
df = pd.read_sql_query(
    """
       SELECT *
       FROM tasks
    """,
    conn
)
df

Empty DataFrame
Columns: [id, description, done]
Index: []

# AGRUPAMENTO E AGREGAÇÃO

Existe um paralelo entre os métodos da biblioteca pandas e as queries SQL. Vejamos por exemplo como contar as linhas da tabela tasks onde done = 1

In [14]:
df['done'].value_counts()

Series([], Name: count, dtype: int64)

Podemos fazer diretamente usando SQL:

In [15]:
results = conn.execute("""
    SELECT done, COUNT(*) AS done_tasks
    FROM tasks
    GROUP BY done;      
""").fetchall()

for result in results:
    print(result)

# Encerrando a conexão

In [16]:
conn.close()

# RELACIONAMENTO

Antes de começar você pode apagar o arquivo database.db, vamos recriá-lo. Se decidir por não apagar, mude o nome do arquivo dessa nova conexão.

In [20]:
conn = sqlite3.connect("database.db")

conn.execute("""
    CREATE TABLE categories 
    (
      id    INTEGER PRIMARY KEY, 
      name  TEXT NOT NULL
    );
""")

conn.execute(
    """
        INSERT INTO categories (name)
        VALUES
          ('casa'),
          ('laser'),
          ('faculdade')
    """
)
conn.commit()

A tabela tasks agora terá uma chave estrangeira (FOREIGN KEY) que faz referência ao campo id da tabela categories. Logo estas duas tabelas estão conectadas.

In [21]:
conn.execute("""
    CREATE TABLE tasks 
    (
      id            INTEGER PRIMARY KEY AUTOINCREMENT, 
      description   TEXT NOT NULL,
      done          INTEGER,
      category_id   INTEGER NOT NULL,
      FOREIGN KEY (category_id) REFERENCES categories (id)
    )
""")
conn.commit()

<center><img src="./assets/tasks_categories_relationship.png" width="400px"></center>

# JOIN

Nosso próximo passo é fazer uma querie que junta as duas tabelas anteriores numa só. Antes, vamos inserir alguns dados na tabela tasks.

In [22]:
# insert many
conn.execute(
    """
    INSERT INTO 'tasks' (description, done, category_id)
    VALUES
      ('Assistir Netflix', 1, 2),
      ('Estudar matplotlib', 0, 3),
      ('Estudar seaborn', 0, 3),
      ('Estudar Pandas', 0, 3),
      ('Lavar louça', 0, 1)
    """
)
conn.commit()

Agora sim, juntaremos as tabelas.

In [23]:
tasks_with_categories = conn.execute(
    """
    SELECT t.id, t.description, t.done, c.name 
    FROM tasks AS t 
    INNER JOIN categories AS c
      ON c.id = t.category_id
    ORDER BY c.name
    """
).fetchall()

for task in tasks_with_categories:
    print(task)

(5, 'Lavar louça', 0, 'casa')
(2, 'Estudar matplotlib', 0, 'faculdade')
(3, 'Estudar seaborn', 0, 'faculdade')
(4, 'Estudar Pandas', 0, 'faculdade')
(1, 'Assistir Netflix', 1, 'laser')

Usando pandas para ter o resultado como um objeto data frame.

In [24]:
df = pd.read_sql_query(
    """
    SELECT t.id, t.description, t.done, c.name 
    FROM tasks AS t 
    INNER JOIN categories AS c
      ON c.id = t.category_id
    ORDER BY c.name
    """,
    conn
)
df

   id         description  done       name
0   5         Lavar louça     0       casa
1   2  Estudar matplotlib     0  faculdade
2   3     Estudar seaborn     0  faculdade
3   4      Estudar Pandas     0  faculdade
4   1    Assistir Netflix     1      laser

# Close connection

In [25]:
conn.close()

# Exercícios

<img src="assets/sqlite-sample-database-color.jpg">

Faça o download do banco SQLite3 no site: https://www.sqlitetutorial.net/sqlite-sample-database/

O arquivo também está na pastas assets, caso não queira fazer o download.

Usando os conhecimentos da aula, resolva os seguinte problemas:

1. Fornecer uma consulta que mostre os clientes (apenas seus nomes completos, ID do cliente e país) que não estão nos EUA.

In [27]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """
        SELECT CustomerId, FirstName || ' ' || LastName AS FullName, Country
        FROM customers
        WHERE Country != 'USA'
    """,
    conn
)
conn.close()
df

    CustomerId               FullName         Country
0            1         Luís Gonçalves          Brazil
1            2          Leonie Köhler         Germany
2            3      François Tremblay          Canada
3            4           Bjørn Hansen          Norway
4            5  František Wichterlová  Czech Republic
5            6            Helena Holý  Czech Republic
6            7          Astrid Gruber         Austria
7            8           Daan Peeters         Belgium
8            9           Kara Nielsen         Denmark
9           10        Eduardo Martins          Brazil
10          11        Alexandre Rocha          Brazil
11          12        Roberto Almeida          Brazil
12          13         Fernanda Ramos          Brazil
13          14           Mark Philips          Canada
14          15      Jennifer Peterson          Canada
15          29           Robert Brown          Canada
16          30         Edward Francis          Canada
17          31            Martha Silk          Canada
18          32         Aaron Mitchell          Canada
19          33         Ellie Sullivan          Canada
20          34         João Fernandes        Portugal
21          35       Madalena Sampaio        Portugal
22          36       Hannah Schneider         Germany
23          37        Fynn Zimmermann         Germany
24          38        Niklas Schröder         Germany
25          39        Camille Bernard          France
26          40     Dominique Lefebvre          France
27          41            Marc Dubois          France
28          42           Wyatt Girard          France
29          43       Isabelle Mercier          France
30          44       Terhi Hämäläinen         Finland
31          45        Ladislav Kovács         Hungary
32          46          Hugh O'Reilly         Ireland
33          47          Lucas Mancini           Italy
34          48  Johannes Van der Berg     Netherlands
35          49       Stanisław Wójcik          Poland
36          50          Enrique Muñoz           Spain
37          51       Joakim Johansson          Sweden
38          52             Emma Jones  United Kingdom
39          53            Phil Hughes  United Kingdom
40          54           Steve Murray  United Kingdom
41          55            Mark Taylor       Australia
42          56        Diego Gutiérrez       Argentina
43          57             Luis Rojas           Chile
44          58           Manoj Pareek           India
45          59        Puja Srivastava           India

2. Fornecer uma consulta que mostre apenas os clientes do Brasil.

In [28]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,+55 (11) 3033-4564,eduardo@woodstock.com.br,4
2,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,+55 (11) 3055-8131,alero@uol.com.br,5
3,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,+55 (21) 2271-7070,roberto.almeida@riotur.gov.br,3
4,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,+55 (61) 3363-7855,fernadaramos4@uol.com.br,4

3. Fornecer uma consulta que mostre as faturas dos clientes que são do Brasil. A tabela resultante deve mostrar o nome completo do cliente, ID da fatura, data da fatura e país de cobrança.

In [38]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,...,SupportRepId,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
5,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,327,1,2012-12-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,13.86
6,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,382,1,2013-08-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,8.91
7,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,...,4,25,10,2009-04-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,8.91
8,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,...,4,154,10,2010-11-14 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
9,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,...,4,177,10,2011-02-16 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,3.96
10,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,...,4,199,10,2011-05-21 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,5.94
11,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,...,4,251,10,2012-01-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,0.99
12,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,...,4,372,10,2013-07-02 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
13,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,...,4,383,10,2013-08-12 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,13.86
14,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,...,5,57,11,2009-09-06 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
15,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,...,5,68,11,2009-10-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,13.86
16,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,...,5,123,11,2010-06-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,8.91
17,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,...,5,252,11,2012-01-22 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
18,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,...,5,275,11,2012-04-25 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,3.96
19,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,...,5,297,11,2012-07-28 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,5.94
20,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,...,5,349,11,2013-03-18 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,0.99
21,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,...,3,34,12,2009-05-23 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,0.99
22,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,...,3,155,12,2010-11-14 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
23,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,...,3,166,12,2010-12-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,13.86
24,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,...,3,221,12,2011-08-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,8.91
25,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,...,3,350,12,2013-03-31 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
26,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,...,3,373,12,2013-07-03 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,3.96
27,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,...,3,395,12,2013-10-05 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,5.94
28,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,...,4,35,13,2009-06-05 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
29,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,...,4,58,13,2009-09-07 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,3.96
30,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,...,4,80,13,2009-12-10 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,5.94
31,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,...,4,132,13,2010-07-31 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,0.99
32,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,...,4,253,13,2012-01-22 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
33,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,...,4,264,13,2012-03-03 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,13.86
34,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,...,4,319,13,2012-11-01 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,8.91

4. Fornecer uma consulta que mostre apenas os funcionários que são agentes de vendas.

In [39]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

   EmployeeId       FullName                Title                     Email
0           3   Jane Peacock  Sales Support Agent      jane@chinookcorp.com
1           4  Margaret Park  Sales Support Agent  margaret@chinookcorp.com
2           5  Steve Johnson  Sales Support Agent     steve@chinookcorp.com

5. Fornecer uma consulta que mostre uma lista única de países de cobrança da tabela de faturas.

In [40]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

    BillingCountry
0        Argentina
1        Australia
2          Austria
3          Belgium
4           Brazil
5           Canada
6            Chile
7   Czech Republic
8          Denmark
9          Finland
10          France
11         Germany
12         Hungary
13           India
14         Ireland
15           Italy
16     Netherlands
17          Norway
18          Poland
19        Portugal
20           Spain
21          Sweden
22             USA
23  United Kingdom

6. Fornecer uma consulta que mostre as faturas associadas a cada agente de vendas. A tabela resultante deve incluir o nome completo do agente de vendas.

In [41]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

     AgentFullName  InvoiceId          InvoiceDate  Total
0     Jane Peacock          6  2009-01-19 00:00:00   0.99
1     Jane Peacock          7  2009-02-01 00:00:00   1.98
2     Jane Peacock          9  2009-02-02 00:00:00   3.96
3     Jane Peacock         10  2009-02-03 00:00:00   5.94
4     Jane Peacock         11  2009-02-06 00:00:00   8.91
..             ...        ...                  ...    ...
407  Steve Johnson        398  2013-10-21 00:00:00   0.99
408  Steve Johnson        402  2013-11-05 00:00:00   5.94
409  Steve Johnson        404  2013-11-13 00:00:00  25.86
410  Steve Johnson        406  2013-12-04 00:00:00   1.98
411  Steve Johnson        408  2013-12-05 00:00:00   3.96

[412 rows x 4 columns]

É possível então saber quantas vendas e qual valor cada agente fez. Como?

7. Fornecer uma consulta que mostre o valor total da fatura, nome do cliente, país e nome do agente de vendas de todas as faturas e clientes.

In [42]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

     InvoiceTotal     CustomerName  Country      AgentName
0            1.98    Julia Barnett      USA  Steve Johnson
1           13.86    Julia Barnett      USA  Steve Johnson
2            8.91    Julia Barnett      USA  Steve Johnson
3            1.98    Julia Barnett      USA  Steve Johnson
4            3.96    Julia Barnett      USA  Steve Johnson
..            ...              ...      ...            ...
407         13.86  Fynn Zimmermann  Germany   Jane Peacock
408         14.91  Fynn Zimmermann  Germany   Jane Peacock
409          1.98  Fynn Zimmermann  Germany   Jane Peacock
410          3.96  Fynn Zimmermann  Germany   Jane Peacock
411          5.94  Fynn Zimmermann  Germany   Jane Peacock

[412 rows x 4 columns]

É possível agora saber qual nosso melhor cliente por valor ou quantidade vendida. Como?

8. Quantas faturas houve em 2009 e 2011? Quais são as vendas totais respectivas para cada um desses anos?

In [43]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

   Year  InvoiceCount  TotalSales
0  2009            83      449.46
1  2011            83      469.58

As vendas aumentaram, mas não tanto quanto esperávamos!

9. Analisando a tabela invoices, forneça uma consulta que CONTE o número de itens para o ID da fatura 37.

In [49]:

conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

   InvoiceId  ItemsQuantity
0         37              4

10. Analisando a tabela invoice_items, forneça uma consulta que CONTE o número de itens para cada fatura. DICA: AGRUPAR POR

In [53]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

     InvoiceId  ItemCount
0            5         14
1           12         14
2           19         14
3           26         14
4           33         14
..         ...        ...
407        384          1
408        391          1
409        398          1
410        405          1
411        412          1

[412 rows x 2 columns]

11. Fornecer uma consulta que inclua o nome da faixa para cada linha da tabela de itens da fatura.

In [54]:

conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

,InvoiceLineId,InvoiceId,TrackId,TrackName
0,1,1,2,Balls to the Wall
1,2,1,4,Restless and Wild
2,3,2,6,Put The Finger On You
3,4,2,8,Inject The Venom
4,5,2,10,Evil Walks
...,...,...,...,...
2235,2236,411,3136,Looking For Love
2236,2237,411,3145,Sweet Lady Luck
2237,2238,411,3154,Feirinha da Pavuna/Luz do Repente/Bagaço da La...
2238,2239,411,3163,Samba pras moças
2239,2240,412,3177,Hot Girl

12. Forneça uma consulta que mostre o nome da música e o artista para cada linha da tabela de itens da fatura.

In [56]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

,InvoiceLineId,TrackName,ArtistName
0,1,Balls to the Wall,Accept
1,2,Restless and Wild,Accept
2,3,Put The Finger On You,AC/DC
3,4,Inject The Venom,AC/DC
4,5,Evil Walks,AC/DC
...,...,...,...
2235,2236,Looking For Love,Lenny Kravitz
2236,2237,Sweet Lady Luck,Lenny Kravitz
2237,2238,Feirinha da Pavuna/Luz do Repente/Bagaço da La...,Zeca Pagodinho
2238,2239,Samba pras moças,Zeca Pagodinho
2239,2240,Hot Girl,The Office

13. Fornecer uma consulta que mostre o número de faturas por país. DICA: AGRUPAR POR

In [57]:
# TODO
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

    BillingCountry  InvoiceCount
0              USA            91
1           Canada            56
2           France            35
3           Brazil            35
4          Germany            28
5   United Kingdom            21
6         Portugal            14
7   Czech Republic            14
8            India            13
9           Sweden             7
10           Spain             7
11          Poland             7
12          Norway             7
13     Netherlands             7
14           Italy             7
15         Ireland             7
16         Hungary             7
17         Finland             7
18         Denmark             7
19           Chile             7
20         Belgium             7
21         Austria             7
22       Australia             7
23       Argentina             7

14. Forneça uma consulta que mostra o número total de música por playlist. O nome e ID das playlists devem aparecer na tabela resultante.

In [60]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

    PlaylistId                PlaylistName  TrackCount
0            1                       Music        3290
1            8                       Music        3290
2            5                  90’s Music        1477
3            3                    TV Shows         213
4           10                    TV Shows         213
5           12                   Classical          75
6           11             Brazilian Music          39
7           17         Heavy Metal Classic          26
8           13   Classical 101 - Deep Cuts          25
9           14  Classical 101 - Next Steps          25
10          15  Classical 101 - The Basics          25
11          16                      Grunge          15
12           9                Music Videos           1
13          18                 On-The-Go 1           1

15.Forneça uma consulta que mostra todos os nomes das músicas, mas não mostra ids. A tabela resultante deve incluir o nome do álbum, tipo de media e gênero.

In [61]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

,TrackName,AlbumTitle,MediaType,Genre
0,"""40""",War,MPEG audio file,Rock
1,"""?""","Lost, Season 2",Protected MPEG-4 video file,TV Shows
2,"""Eine Kleine Nachtmusik"" Serenade In G, K. 525...",Sir Neville Marriner: A Celebration,Protected AAC audio file,Classical
3,#1 Zero,Out Of Exile,MPEG audio file,Alternative & Punk
4,#9 Dream,Instant Karma: The Amnesty International Campa...,Protected AAC audio file,Pop
...,...,...,...,...
3498,É que Nessa Encarnação Eu Nasci Manga,Axé Bahia 2001,MPEG audio file,Pop
3499,"Étude 1, In C Major - Preludio (Presto) - Liszt",Liszt - 12 Études D'Execution Transcendante,Purchased AAC audio file,Classical
3500,Óculos,Arquivo Os Paralamas Do Sucesso,MPEG audio file,Latin
3501,Óia Eu Aqui De Novo,As Canções de Eu Tu Eles,MPEG audio file,Soundtrack
3502,Último Pau-De-Arara,As Canções de Eu Tu Eles,MPEG audio file,Soundtrack

16. Fornecer uma consulta que mostra o número total de vendas de cada vendedor.

In [62]:

conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

      SalesAgent  TotalSales
0   Jane Peacock      833.04
1  Margaret Park      775.40
2  Steve Johnson      720.16

17. Qual vendedor (sales agent) mais vendeu em 2009?

In [63]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

      SalesAgent  TotalSales
0  Steve Johnson      164.34

18. Qual vendedor (sales agent) mais vendeu considerando toda base de dados?

In [64]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

     SalesAgent  TotalSales
0  Jane Peacock      833.04

19. Forneça uma consulta que mostra o número de clientes inscritos para cada vendedor (sales agente).

In [65]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

      SalesAgent  CustomerCount
0   Jane Peacock             21
1  Margaret Park             20
2  Steve Johnson             18

20. Forneça uma consulta que mostra o total de vendas por país.

In [67]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

    BillingCountry  TotalSales
0              USA          91
1           Canada          56
2           France          35
3           Brazil          35
4          Germany          28
5   United Kingdom          21
6         Portugal          14
7   Czech Republic          14
8            India          13
9           Sweden           7
10           Spain           7
11          Poland           7
12          Norway           7
13     Netherlands           7
14           Italy           7
15         Ireland           7
16         Hungary           7
17         Finland           7
18         Denmark           7
19           Chile           7
20         Belgium           7
21         Austria           7
22       Australia           7
23       Argentina           7

21. De qual país os clientes mais gastaram?

In [68]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

    BillingCountry  TotalSales
0              USA      523.06
1           Canada      303.96
2           France      195.10
3           Brazil      190.10
4          Germany      156.48
5   United Kingdom      112.86
6   Czech Republic       90.24
7         Portugal       77.24
8            India       75.26
9            Chile       46.62
10         Ireland       45.62
11         Hungary       45.62
12         Austria       42.62
13         Finland       41.62
14     Netherlands       40.62
15          Norway       39.62
16          Sweden       38.62
17          Poland       37.62
18           Italy       37.62
19         Denmark       37.62
20       Australia       37.62
21       Argentina       37.62
22           Spain       37.62
23         Belgium       37.62

22. Forneça uma consulta que mostra a faixa mais comprada de 2013.

In [108]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

       TrackName  PurchaseCount
0  Black Diamond              1

Será que está certo o resultado? Pense sobre!

23. Forneça uma consulta que mostra os top 3 artistas mais vendidos de toda base de dados.

In [110]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

    ArtistName  TotalSold
0  Iron Maiden        140
1           U2        107
2    Metallica         91

24. Forneça uma query que mostra qual o tipo de media mais comprado.

In [114]:
conn = sqlite3.connect("assets/chinook.db")
df = pd.read_sql_query(
    """

    """,
    conn
)
conn.close()
df

         MediaType  PurchaseCount
0  MPEG audio file           1976

### Referência para os exercícios:

http://www.berkut.mk.ua/download/pdf/db/task_vesna.pdf